In [28]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\kayna\appdata\roaming\python\python313\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\kayna\appdata\roaming\python\python313\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kayna\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\kayna\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\kayna\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\kayna\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [29]:
import pandas as pd

In [30]:
data={
    'student_name': ['raj','ivan','durgesh','riya','harmeet','hardeep'],
    'student_id': [101,102,103,104,105,106],
    'student_marks': [10,20, 30,40, 50,60]
}

In [31]:
df=pd.DataFrame(data)

In [32]:
df

  student_name  student_id  student_marks
0          raj         101             10
1         ivan         102             20
2      durgesh         103             30
3         riya         104             40
4      harmeet         105             50
5      hardeep         106             60

In [33]:
df.head()

  student_name  student_id  student_marks
0          raj         101             10
1         ivan         102             20
2      durgesh         103             30
3         riya         104             40
4      harmeet         105             50

In [34]:
df.head(2)

  student_name  student_id  student_marks
0          raj         101             10
1         ivan         102             20

In [35]:
df.tail(2)

  student_name  student_id  student_marks
4      harmeet         105             50
5      hardeep         106             60

In [36]:
df=pd.DataFrame(data)

In [37]:
df

  student_name  student_id  student_marks
0          raj         101             10
1         ivan         102             20
2      durgesh         103             30
3         riya         104             40
4      harmeet         105             50
5      hardeep         106             60

In [39]:
df.columns

Index(['student_name', 'student_id', 'student_marks'], dtype='object')

In [40]:
df.student_marks

0    10
1    20
2    30
3    40
4    50
5    60
Name: student_marks, dtype: int64

In [41]:
len(df)

6

In [44]:
print("average marks: ",round(df.student_marks.sum()/len(df)))

average marks:  35